
# Arc Browser
cask "arc"

# Warp
cask "warp"

# Zed
cask "zed"

# VSCode
cask "visual-studio-code"

# Figma
cask "figma"

# Raycast
cask "raycast"

# TopNotch
cask "topnotch"

# Rectangle
cask "rectangle"

# CleanShotX
cask "cleanshot"

# Hidden Bar
cask "hiddenbar"

# Tidal
cask "tidal"

# DevToys
cask "devtoys"

# RunJS
cask "runjs"

# PixelSnap2
cask "pixelsnap"

# Discord
cask "discord"

# Telegram
cask "telegram"

# Numi
cask "numi"

# IINA
cask "iina"

# Stremio
cask "stremio"

# Unarchiver
cask "the-unarchiver"

# Transmission
cask "transmission"

# ------------
# Paste (App Store)
# Screen Studio (Website)
