# ------------ Taps -----------
tap "homebrew/cask-fonts" || true
tap "homebrew/cask-versions" || true


## ------------ Fonts ------------

# JetBrains Mono
cask "font-jetbrains-mono"

## ------------ Browsers ------------
# Arc Browser
cask "arc"

# Firefox
cask "firefox-developer-edition"

## ------------ Terminal ------------

# Warp
cask "warp"

# Spaceship
brew "spaceship"

## ------------ Code Editors ------------

# Zed
cask "zed"

# VSCode
cask "visual-studio-code"


## ------------ macOS Utilities ------------

# Raycast
cask "raycast"

# TopNotch
cask "topnotch"

# Rectangle
cask "rectangle"

# CleanShotX
cask "cleanshot"

# Hidden Bar
cask "hiddenbar"

# Unarchiver
cask "the-unarchiver"

# Numi
cask "numi"

# Maccy
cask "maccy"

# CleanMyMac
cask "cleanmymac"

# Cron
cask "cron"

# Screenflow
cask "screenflow"

# ElGato
cask "elgato-control-center"

## ------------ Media ------------

# Tidal
cask "tidal"

# IINA
cask "iina"

# Stremio
cask "stremio"

# Transmission
cask "transmission"

## ------------ Developer Utilities ------------

# Git
brew "git"

# FNM
brew "fnm"

# DevToys
cask "devtoys"

# RunJS
cask "runjs"

# Pixel Measuring
cask "sip"

# Color Picker
cask "pixelsnap"

# Obsidian
cask "obsidian"

# Responsively
cask "responsively"

# ImageOptim
cask "imageoptim"

# Hoppscotch
cask "hoppscotch"

# Linear
cask "linear-linear"

## ------------ Communication ------------

# Discord
cask "discord"

# Zoom
cask "zoom"

# MeetingBar
brew "meetingbar"

# Hovrly
cask "hovrly"

## ------------ Others (outside Homebrew) ------------
# - LocalCan (Website)
# - Screen Studio (Website)
# - HandMirror (App Store)
# - Menu Bar Calendar (App Store)
