## ------------ Browsers ------------

# Arc Browser
cask "arc"

# Polypane
cask "polypane"

## ------------ Terminal ------------

# Warp
cask "warp"

# Spaceship
brew "spaceship"

# Tree
brew "erdtree"

## ------------ Code Editors ------------

# Cursor
cask "cursor"

## ------------ macOS Utilities ------------

# Raycast
cask "raycast"

# Rectangle
cask "rectangle"

# CleanShotX
cask "cleanshot"

# Screen Studio
cask "screen-studio"

# Hidden Bar
cask "hiddenbar"

# Unarchiver
cask "the-unarchiver"

# Numi
cask "numi"

# CleanMyMac
cask "cleanmymac"

# Downie
cask "downie"

# CleanMyMacX
cask "cleanmymac"

# PixelSnap2
cask "pixelsnap"

# Clop
cask "clop"

# OneSwitch
cask "one-switch"

## ------------ Media ------------

# Tidal
cask "tidal"

# Spotify
cask "spotify"

# IINA
cask "iina"

# Stremio
cask "stremio"

# Transmission
cask "transmission"

# Logitech
cask "logitech-g-hub"

## ------------ Developer Utilities ------------

# Bun
brew "bun"

# Rust
brew "rust"

# Git
brew "git"

# FNM
brew "fnm"

# RunJS
cask "runjs"

# ImageOptim
cask "imageoptim"

# Yaak
cask "yaak"

# Linear
cask "linear-linear"

# LocalCan
cask "localcan"

# DevUtils
cask "devutils"

# Figma
cask "figma"

# OrbStack
cask "orbstack"

# TablePlus
cask "tableplus"

# Fly.io
brew "flyctl"

## ------------ Communication ------------

# Discord
cask "discord"

# Slack
cask "slack"

# Hovrly
cask "hovrly"


## ------------ Health ------------

# LookAway
cask "lookaway"


## ------------ From website ------------

# Texts
